$(document).ready(function() {
    $('#dateto').datepicker({

        // Days' name of the week.

        days: [ "الأحد",
            "الاثنين",
            "الثلاثاء",
            "الأربعاء",
            "الخميس",
            "الجمعة",
            "السبت"],
// Shorter days' name

        daysShort: [   "الأحد",
            "الاثنين",
            "الثلاثاء",
            "الأربعاء",
            "الخميس",
            "الجمعة",
            "السبت"],



// Shortest days' name

        daysMin: [    "ح",
            "ن",
            "ث",
            "ر",
            "خ",
            "ج",
            "س"],



// Months' name

        months: [   "يناير",
            "فبراير",
            "مارس",
            "أبريل",
            "مايو",
            "يونيو",
            "يوليو",
            "أغسطس",
            "سبتمبر",
            "أكتوبر",
            "نوفمبر",
            "ديسمبر"],



// Shorter months' name

        monthsShort: [   "يناير",
            "فبراير",
            "مارس",
            "أبريل",
            "مايو",
            "يونيو",
            "يوليو",
            "أغسطس",
            "سبتمبر",
            "أكتوبر",
            "نوفمبر",
            "ديسمبر"]


    });
    $('#datefrom').datepicker({

        // Days' name of the week.

        days: [ "الأحد",
            "الاثنين",
            "الثلاثاء",
            "الأربعاء",
            "الخميس",
            "الجمعة",
            "السبت"],
// Shorter days' name

        daysShort: [   "الأحد",
            "الاثنين",
            "الثلاثاء",
            "الأربعاء",
            "الخميس",
            "الجمعة",
            "السبت"],



// Shortest days' name

        daysMin: [    "ح",
            "ن",
            "ث",
            "ر",
            "خ",
            "ج",
            "س"],



// Months' name

        months: [   "يناير",
            "فبراير",
            "مارس",
            "أبريل",
            "مايو",
            "يونيو",
            "يوليو",
            "أغسطس",
            "سبتمبر",
            "أكتوبر",
            "نوفمبر",
            "ديسمبر"],



// Shorter months' name

        monthsShort: [   "يناير",
            "فبراير",
            "مارس",
            "أبريل",
            "مايو",
            "يونيو",
            "يوليو",
            "أغسطس",
            "سبتمبر",
            "أكتوبر",
            "نوفمبر",
            "ديسمبر"]


    });


    $('#cmd-date').datepicker({

        // Days' name of the week.

        days: [ "الأحد",
            "الاثنين",
            "الثلاثاء",
            "الأربعاء",
            "الخميس",
            "الجمعة",
            "السبت"],
// Shorter days' name

        daysShort: [   "الأحد",
            "الاثنين",
            "الثلاثاء",
            "الأربعاء",
            "الخميس",
            "الجمعة",
            "السبت"],



// Shortest days' name

        daysMin: [    "ح",
            "ن",
            "ث",
            "ر",
            "خ",
            "ج",
            "س"],



// Months' name

        months: [   "يناير",
            "فبراير",
            "مارس",
            "أبريل",
            "مايو",
            "يونيو",
            "يوليو",
            "أغسطس",
            "سبتمبر",
            "أكتوبر",
            "نوفمبر",
            "ديسمبر"],



// Shorter months' name

        monthsShort: [   "يناير",
            "فبراير",
            "مارس",
            "أبريل",
            "مايو",
            "يونيو",
            "يوليو",
            "أغسطس",
            "سبتمبر",
            "أكتوبر",
            "نوفمبر",
            "ديسمبر"]


    });


});